In [1]:
import pandas as pd
import numpy as np

In [116]:
df = pd.read_csv('adult.csv')

In [33]:
df.head()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [54]:
df.isnull().sum()

age                0
workclass          0
fnlwgt             0
education          0
educational-num    0
marital-status     0
occupation         0
relationship       0
race               0
gender             0
capital-gain       0
capital-loss       0
hours-per-week     0
native-country     0
income             0
dtype: int64

# Data cleaning

In [55]:
col = ['workclass', 'education', 'marital-status', 'occupation', 'relationship','race','gender','native-country','income']
for i in col:
    df[i] = df[i].str.strip()

# How many men and women (sex feature) are represented in this dataset?

In [4]:
df['gender'].value_counts()

 Male      21790
 Female    10771
Name: gender, dtype: int64

# What is the average age (age feature) of women?

In [57]:
df['age'][df['gender']=='Female'].mean()

36.85823043357163

# What is the percentage of German citizens (native-country feature)?

In [58]:
Germany = df['native-country'][df['native-country']=='Germany'].value_counts()
Germany / df['native-country'].count()

Germany    0.004207
Name: native-country, dtype: float64

# What are the mean and standard deviation of age for those who earn more than 50K per year  (salary feature) and those who earn less than 50K per year?

In [65]:
print(f"Age mean income <=50K: {df['age'][df['income']=='<=50K'].mean()}")
print(f"Age std income <=50K: {df['age'][df['income']=='<=50K'].std()}")
print(f"Age mean income >=50K: {df['age'][df['income']=='>50K'].mean()}")
print(f"Age std income >=50K: {df['age'][df['income']=='>50K'].std()}")

Age mean income <=50K: 36.78373786407767
Age std income <=50K: 14.020088490824813
Age mean income >=50K: 44.24984058155847
Age std income >=50K: 10.51902771985177

#  Is it true that people who earn more than 50K have at least a high school education? (education – Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters or Doctorate feature)

In [66]:
df['education'][df['income']=='>50K'].value_counts()

Bachelors       2221
HS-grad         1675
Some-college    1387
Masters          959
Prof-school      423
Assoc-voc        361
Doctorate        306
Assoc-acdm       265
10th              62
11th              60
7th-8th           40
12th              33
9th               27
5th-6th           16
1st-4th            6
Name: education, dtype: int64

# Display age statistics for each race (race feature) and each gender (sex feature). Use groupby() and describe(). Find the maximum age of men of Amer-Indian-Eskimo race.

In [70]:
df.groupby(['race','gender'])['age'].describe()

                             count       mean        std   min   25%   50%  \
race               gender
Amer-Indian-Eskimo Female    119.0  37.117647  13.114991  17.0  27.0  36.0
                   Male      192.0  37.208333  12.049563  17.0  28.0  35.0
Asian-Pac-Islander Female    346.0  35.089595  12.300845  17.0  25.0  33.0
                   Male      693.0  39.073593  12.883944  18.0  29.0  37.0
Black              Female   1555.0  37.854019  12.637197  17.0  28.0  37.0
                   Male     1569.0  37.682600  12.882612  17.0  27.0  36.0
Other              Female    109.0  31.678899  11.631599  17.0  23.0  29.0
                   Male      162.0  34.654321  11.355531  17.0  26.0  32.0
White              Female   8642.0  36.811618  14.329093  17.0  25.0  35.0
                   Male    19174.0  39.652498  13.436029  17.0  29.0  38.0

                             75%   max
race               gender
Amer-Indian-Eskimo Female  46.00  80.0
                   Male    45.00  82.0
Asian-Pac-Islander Female  43.75  75.0
                   Male    46.00  90.0
Black              Female  46.00  90.0
                   Male    46.00  90.0
Other              Female  39.00  74.0
                   Male    42.00  77.0
White              Female  46.00  90.0
                   Male    49.00  90.0

In [81]:
df[(df['race']=='Amer-Indian-Eskimo') & (df['gender']=='Male')]['age'].max()

82

In [93]:
df.iloc[:,[0,8]]

       age   race
0       39  White
1       50  White
2       38  White
3       53  Black
4       28  Black
...    ...    ...
32556   27  White
32557   40  White
32558   58  White
32559   22  White
32560   52  White

[32561 rows x 2 columns]

# Among whom is the proportion of those who earn a lot (>50K) greater: married or single men (marital-status feature)? Consider as married those who have a marital-status starting with Married (Married-civ-spouse, Married-spouse-absent or Married-AF-spouse), the rest are considered bachelors.

In [95]:
df['marital-status'].unique()

array(['Never-married', 'Married-civ-spouse', 'Divorced',
       'Married-spouse-absent', 'Separated', 'Married-AF-spouse',
       'Widowed'], dtype=object)

In [ ]:
mapping = {'Never-married':"Bachelor", 'Married-civ-spouse', 'Divorced':"Bachelor",
           'Married-spouse-absent', 'Separated', 'Married-AF-spouse','Widowed'}

#  What is the maximum number of hours a person works per week (hours-per-week feature)? How many people work such a number of hours, and what is the percentage of those who earn a lot (>50K) among them?

In [96]:
df['hours-per-week'].max()

99

In [98]:
df[df['hours-per-week'] == df['hours-per-week'].max()]['hours-per-week'].count()

85

In [99]:
df[(df['hours-per-week'] == df['hours-per-week'].max()) & (df['income']=='>50K')]['hours-per-week'].count()

25

In [100]:
25/85

0.29411764705882354

# Count the average time of work (hours-per-week) for those who earn a little and a lot (salary) for each country (native-country). What will these be for Japan?

In [104]:
df.groupby(['native-country','income'])['hours-per-week'].describe()

                        count       mean        std   min    25%   50%   75%  \
native-country income
?              <=50K    437.0  40.164760  12.817002   1.0  40.00  40.0  45.0
               >50K     146.0  45.547945  10.202827   8.0  40.00  40.0  50.0
Cambodia       <=50K     12.0  41.416667   3.088346  40.0  40.00  40.0  40.5
               >50K       7.0  40.000000   0.000000  40.0  40.00  40.0  40.0
Canada         <=50K     82.0  37.914634  13.012056   8.0  32.75  40.0  40.0
...                       ...        ...        ...   ...    ...   ...   ...
United-States  >50K    7171.0  45.505369  11.025092   1.0  40.00  40.0  50.0
Vietnam        <=50K     62.0  37.193548  12.422664   1.0  40.00  40.0  40.0
               >50K       5.0  39.200000   1.788854  36.0  40.00  40.0  40.0
Yugoslavia     <=50K     10.0  41.600000  11.305849  20.0  40.00  40.0  40.0
               >50K       6.0  49.500000  11.202678  40.0  40.00  46.0  58.0

                        max
native-country income
?              <=50K   99.0
               >50K    80.0
Cambodia       <=50K   50.0
               >50K    40.0
Canada         <=50K   70.0
...                     ...
United-States  >50K    99.0
Vietnam        <=50K   77.0
               >50K    40.0
Yugoslavia     <=50K   66.0
               >50K    65.0

[82 rows x 8 columns]

# Find out the total number of hours worked and mean salary as per different occupations.

In [105]:
df.groupby(['occupation'])['hours-per-week'].sum()

occupation
?                     58803
Adm-clerical         141595
Armed-Forces            366
Craft-repair         173405
Exec-managerial      182920
Farming-fishing       46708
Handlers-cleaners     51988
Machine-op-inspct     81593
Other-service        114342
Priv-house-serv        4900
Prof-specialty       175481
Protective-serv       27823
Sales                148851
Tech-support          36593
Transport-moving      71316
Name: hours-per-week, dtype: int64

In [ ]:
df.groupby(['occupation'])['hours-per-week'].sum()

In [106]:
df['income'].value_counts()

<=50K    24720
>50K      7841
Name: income, dtype: int64

In [110]:
df['age'].rolling?

Object `rolling` not found.

In [112]:
df['age']

0        39
1        50
2        38
3        53
4        28
         ..
32556    27
32557    40
32558    58
32559    22
32560    52
Name: age, Length: 32561, dtype: int64

In [119]:
df['age'].rolling(3, min_periods=1).mean()

0        39.000000
1        44.500000
2        42.333333
3        47.000000
4        39.666667
           ...
32556    34.000000
32557    29.666667
32558    41.666667
32559    40.000000
32560    44.000000
Name: age, Length: 32561, dtype: float64

In [ ]:
df.fillna(method=)

In [113]:
# Create a sample DataFrame
df = pd.DataFrame({'value': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]})

# Create a rolling window object over the 'value' column with a window size of 3
rolling_window = df['value'].rolling(window=3)

# Compute the rolling mean of the data in the window
rolling_mean = rolling_window.mean()

# Print the rolling mean
print(rolling_mean)

0    NaN
1    NaN
2    2.0
3    3.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
Name: value, dtype: float64